import React, { Component } from 'react'
import './App.css'
import Grid from "./components/Grid";
import NodeLegend from "./components/NodeLegend";
import Figure from "./components/Figure";

type Props = {
}

type State = {
  spoilersVisible: boolean,
}

class App extends Component<Props, State> {
  constructor(props: Props) {
    super(props);

    this.state = {
      spoilersVisible: false,
    }
  }

  // noinspection JSMethodCanBeStatic
  renderMainPost() {
    let spoilerOrNot;
    let showSpoilerButton;
    if (!this.state.spoilersVisible) {
      spoilerOrNot = "spoiler";
      // showSpoilerButton = <WidgetButton highlighted={false} onClick={() => { this.setState({criticalThresholdVisible: true}); } } >Show spoilers</WidgetButton>
    } else {
      spoilerOrNot = "spoiler-revealed";
      // showSpoilerButton = <WidgetButton highlighted={false} onClick={() => { this.setState({criticalThresholdVisible: false}); } } >Hide spoilers</WidgetButton>
    }
    showSpoilerButton = <label><span style={{cursor: "pointer"}}><input type="checkbox" value={this.state.spoilersVisible} onChange={(e) => { this.setState({spoilersVisible: e.target.checked}); }}/> Εμφάνιση spoiler</span></label>;


    let exposed_you = <code className="code-exposed">εσύ</code>;

    let susceptible = <code className="code-susceptible">Ευάλωτος</code>;
    let infected = <code className="code-infectious">Θετικός</code>;
    let recovered = <code className="code-removed">Ιάθηκε</code>;
    let dead = <code className="code-dead">Νεκρός</code>;
    let selfQuarantined = <code className="code-quarantined">Σε αυτο-περιορισμό</code>;

    // noinspection HtmlRequiredAltAttribute
    return (
      <div className="post-content">
        <div>
          <h1>Μένουμε Σπίτι</h1>
          <h5 className="author">του <a href="https://www.facebook.com/g.metsis" target="_blank">Γιώργου Μέτση</a><br/> 20 Μαρτίου, 2020</h5>
        </div>
        <div>
          Ο <a href="https://twitter.com/Harry_Stevens" target="_blank">Harry Stevens</a> από τη Washington Post πρόσφατα δημοσίευσε μια <em>πολύ </em> 
           κομψή προσομοίωση του τρόπου μετάδοσης μιας ασθένειας σαν τη COVID-19. 
          Σας συνιστώ ανεπιφύλακτα να το <a href="https://www.washingtonpost.com/graphics/2020/world/corona-simulator/" target="_blank">διαβάσετε</a>.
        </div>
        <div>
          Εδώ κάνω μια προσπάθεια να κάνω εικόνα όλα όσα ακούμε στις τηλεοράσεις και τα ραδιόφωνα και διαβάζουμε στο διαδίκτυο, 
          χρησιμοποιώντας: <strong>διαδραστικές προσομοιώσεις</strong> εξάπλωσης μιας ασθένειας. "Διαδραστική" σημαίνει πως μπορείς 
          να πειράξεις τις παραμέτρους (όπως τους ρυθμούς μετάδοσης και θνησιμότητας) και να παρακολουθήσεις πως εκτυλίσσεται η επιδημία.
        </div>
        <div>
          Στο τέλος αυτού του άρθρου, ελπίζω πως θα έχεις μια καλύτερη κατανόηση — ίσως καλύτερη <em>διαίσθηση</em> — για τα μέτρα που μπορούν να περιορίσουν αυτό το φαινόμενο. Αλλά πρώτα!...
        </div>
        <div>
          <span style={{backgroundColor: '#FFC'}}><strong>ΜΙΑ ΣΗΜΑΝΤΙΚΗ ΠΡΟΕΙΔΟΠΟΙΗΣΗ</strong></span>:
        </div>
        <div>
          <strong><em>Δεν</em> πρόκειται για προσπάθεια μοντελοποίσης της COVID-19.</strong>
        </div>
        <div>
          Αυτό που ακολουθεί είναι ένα <em>απλουστευμένο</em> μοντέλο της προόδου μιας μεταδοτικής ασθένειας. 
          Σκοπός είναι η ανάπτυξη <em>διαίσθησης</em> και <em>αισθήματος εμπιστοσύνης</em> στα μέτρα που ανακοινώνονται από τις αρμόδιες αρχές. 
        </div>
        <div>
          <span>ΠΡΟΕΙΔΟΠΟΙΗΣΗ #2</span>: Δεν είμαι επιδημιολόγος! Ακολουθώ τις συμβουλές των ειδικών (και αυτό πρέπει να κάνεις και εσύ). 
          Έχω σχεδόν σίγουρα κάνει λάθη σε αυτό το άρθρο, αλλά προτίθεμαι να τα διορθώσω άμεσα. Αν βρείς κάτι που δεν πάει καλά, παρακαλώ <a target="_blank" href="mailto:geoptw@gmail.com">ενημέρωσέ με</a>.
        </div>
        <div>
          Σύμφωνοι?
        </div>
        <div>
          Ας ξεκινήσουμε.
        </div>
        <div>
          <h3>Ένα πλέγμα από ανθρώπους</h3>
        </div>
        <div>
          Θα χτίσουμε το μοντέλο μας σιγά σιγά, ένα βήμα τη φορά.
        </div>
        <div>
          Το πρώτο πράγμα που χρειάζεται μια μεταδοτική ασθένεια είναι ένας <strong>πληθυσμός</strong>, δηλαδή, το σύνολο των ανθρώπων που μπορεί να κολλήσουν. 
          Στο παράδειγμά μας ο πληθυσμός κατοικεί σε ταχτοποιημένες γραμμές και στήλες, όπως το 9x9 πλέγμα που βλέπεις εδώ:
        </div>
        <Figure>
          <Grid daysIncubating={0}
                daysSymptomatic={1}
                gridRows={9}
                gridCols={9}
                nodeSize={30}
                nug={1}
                randomSeed={100}
                personHours={4}
                showPlaybackControls={false}
                speed={0.4}
                transmissionProbability={1}
                travelRadius={1}
          />
        </Figure>
        <div>
          Κάθε τετράγωνο αντιπροσωπεύει έναν άνθρωπο. Αυτή η καημένη ψυχή στο κέντρο, όπως θα φαντάστηκες ήδη, είναι {infected}. 
          Εν τω μεταξύ, όλοι οι άλλοι είναι {susceptible}.
        </div>
        <div>
          <h3>Χρόνος</h3>
        </div>
        <div>
          Τώρα ας εισάγουμε τον χρόνο στο μοντέλο μας.
        </div>
        <div>
          Το κουμπί "Βήμα" (παρακάτω) προχωρά τη προσομοίωση 1 μέρα μπροστά κάθε φορά που κάνεις κλίκ. 
          Εναλλακτικά, μπορέις να πατήσεις το κουμπί ▷  και να δείς τις μέρες να προχωράνε αυτόματα:
        </div>
        <Figure>
          <Grid daysIncubating={0}
                daysSymptomatic={10000000000}
                gridRows={9}
                gridCols={9}
                nodeSize={30}
                nug={1}
                randomSeed={100}
                personHours={4}
                showInteractions={false}
                speed={0.4}
                transmissionProbability={1}
                travelRadius={1}
          />
        </Figure>
        <div>
          Ωχ όχι! Φαίνεται πως όλοι φταρνίστηκαν πάνω στους γείτονές τους — βόρεια, ανατολικά, νότια, δυτικά — και όλος ο κόσμος αρρώστησε.
        </div>
        <div>
          <h3>Ίαση</h3>
        </div>
        <div>
          Αλλά οι άνθρωποι δεν παραμένουν άρρωστοι για πάντα. Ας δούμε τι συμβαίνει όταν συνέρχονται μετά από 2 βήματα (π.χ., 2 μέρες):
        </div>
        <Figure>
          <Grid daysIncubating={0}
                daysSymptomatic={2}
                gridRows={9}
                gridCols={9}
                nodeSize={30}
                nug={1}
                randomSeed={100}
                personHours={4}
                showInteractions={false}
                speed={0.4}
                transmissionProbability={1}
                travelRadius={1}
          />
        </Figure>
        <div>
          Ωράια, τώρα οι άνθρωποι μπορούν να αλλάξουν κατάσταση από {infected} σε {recovered}.
        </div>
        <div>
          Παρακάτω ένα χρήσιμο υπόμνημα:
        </div>
        <div>
          <ul>
            <li><NodeLegend type="susceptible"/> &nbsp;<b>Ευάλωτος</b></li>
            <li><NodeLegend type="infected"/> &nbsp;<b>Θετικός</b></li>
            <li><NodeLegend type="removed"/> &nbsp;<b>Ιάθηκε</b></li>
          </ul>
        </div>
        <div>
          Στα πλαίσια της προσομοίωσής μας, αν κάποιος {recovered}, δεν μπορεί να ξανά μολυνθεί. Ευελπιστούμε (και είναι πολύ πιθανό) αυτό να ισχύει και για τη COVID-19, αλλά δεν ξέρουμε ακόμα.
        </div>
        <div>
          <h3>Περίοδος επώασης</h3>
        </div>
        <div>
          Σε συζητήσεις γα τη COVID-19, ίσως να έχεις ακούσει πως η ασθένεια έχει μια μεγάλη <strong>περίοδο επώασης</strong>. 
          Αυτός είναι ο χρόνος μεταξύ της πρώτης επαφής με την ασθένεια μέχρι την εκδήλωση των πρώτων συμπτωμάτων.
        </div>
        <div>
          Στη περίπτωση της COVID-19, φαίνεται πως οι ασθενείς μεταδίδουν τον ιό κατά τη περίοδο επώασης. Ίσως να μην γνωρίζουν καν πως νοσούν, αλλά μπορούν να το μεταδώσουν σε άλλους.
        </div>
        <div>
          Θα αναπαράγουμε αυτό το χαρακτηριστικό της ασθένειας στο μοντέλο μας. (Αλλά να θυμάσαι, δεν προσπαθούμε να μοντελοποιήσουμε τη COVID-19 επακριβώς!)
        </div>
        <div>
          Να πως φαίνεται η περίοδος επώασης:
        </div>
        <Figure>
          <Grid gridRows={25}
                gridCols={25}
                nodeSize={20}
                nug={1}
                randomSeed={100}
                personHours={4}
                showDaysPerStateControls={true}
                showInteractions={false}
                speed={0.4}
                transmissionProbability={1}
                travelRadius={1}
          />
        </Figure>
        <div>
          Με το τρόπο που επέλεξα να μοντελοποιήσω την ασθένεια, δεν υπάρχει σημαντική διαφορά μεταξύ των ροζ και κόκκινων καταστάσεων. 
          Όσον αφορά τον ιό, και οι δύο καταστάσεις συμπεριφέρονται το ίδιο.
        </div>
        <div>
          Παρ'όλα αυτά, ήθελα να συμπεριλάβω τη περίοδο επώασης σαν μια (οπτική) υπενθύμιση πως οι φορείς της COVID-19 βρίσκονται ανάμεσά μας, 
          κρυμμένοι από τις επίσημες στατιστικές, αγνοώντας πλήρως πως είναι θετικοί.
        </div>
        <div>
          ... αγνοώντας πως μεταδίδουν την ασθένεια στους άλλους.
        </div>
        <div>
          Ακόμα και καθώς διαβάζεις αυτό το άρθρο, {exposed_you} μπορεί να είσαι ένας από τους φορείς.
        </div>
        <div>
          <ul>
            <li><NodeLegend type="susceptible"/> &nbsp;<b>Ευάλωτος</b></li>
            <li><NodeLegend type="exposed"/> &nbsp;<b>Θετικός (περίοδος επώασης, ασυμπτωματικός)</b></li>
            <li><NodeLegend type="infected"/> &nbsp;<b>Θετικός (με συμπτώματα)</b></li>
            <li><NodeLegend type="removed"/> &nbsp;<b>Ιάθηκε</b></li>
          </ul>
        </div>
        <div>
          <h3>Πιθανοκρατική μετάδωση</h3>
        </div>
        <div>
          OK, αρκετά.
        </div>
        <div>
          Οι πραγματικές ασθένειες δεν μεταδίδονται με 100 τις εκατό βεβαιότητα. Μεταδίδονται πιθανοκρατικά.
        </div>
        <div>
          Οπότε ας εισαγάγουμε μια καινούργια παράμετρο: το <strong>ρυθμό μετάδοσης</strong>. Αυτή η παράμετρος ελέγχει τη πιθανότητα η ασθένεια να περάσει από άνθρωπο σε άνθρωπο.
        </div>
        <div>
          Μπορείς να βρείς μια τιμή για το ρυθμό μετάδοσης που αποτρέπει την εξάπλωση σε ολόκληρο το πληθυσμό?
        </div>
        <Figure>
          <Grid gridRows={51}
                gridCols={51}
                maxTransmissionRate={1}
                nodeSize={10}
                nug={5}
                randomSeed={99}
                personHours={4}
                showDaysPerStateControls={true}
                showInteractions={false}
                showProTip={true}
                showTransmissionProbabilitySlider={true}
                speed={0.9}
                transmissionProbability={0.5}
                travelRadius={1}
          />
        </Figure>
        <div>
          Ερώτηση: Ποιός είναι ο <em>μεγαλύτερος</em> ρυθμός μετάδοσης όπου η ασθένεια αδυνατεί να συνεχίσει την εξάπλωση για πάντα (π.χ., να φτάσει σε όλες τις πλευρές του πλέγματος)?
        </div>
        <div style={{marginLeft: '2em'}}>
          {showSpoilerButton}
        </div>
        <div>
          Στις δικές μου δοκιμές, φαίνεται να είναι γύρω στο <span className={spoilerOrNot}>0.35</span>, ίσως <span className={spoilerOrNot}>0.34</span>. 
          Κάτω απ'αυτό, παρατήρησα πως κάθε φορά σταματούσε η εξάπλωση. Παραπάνω, γενικά μολύνεται ολόκληρο το πλέγμα.
        </div>
        <div>
          Να πως δουλέυει η μετάδοση στο μοντέλο μας.
        </div>
        <div>
          Κάθε μέρα, κάθε άτομο έχει ένα σταθερό αριθμό <strong>συναθροίσεων</strong> με τους γύρω ανθρώπους.
        </div>
        <div>
          Μέχρι στιγμής, επιτρέψαμε στους ανθρώπους να αλληλεπιδρούν μόνο με τους άμεσους γείτονές τους, στο σύνολο 4 συναθροίσεις τη μέρα. 
          Θα μεταβάλλουμε αυτές τις παραδοχές παρακάτω.
        </div>
        <div>
          Κατά τη διάρκεια κάθε συνάθροισης, ο ρυθμός μετάδοσης καθορίζει τη πιθανότητα κάποιος {infected} φορέας να κολλήσει έναν {susceptible}. 
          Όσο πιο μεγάλος ο ρυθμός μετάδοσης, τόσο πιο εύκολα κολλάει η ασθένεια.
        </div>
        <div>
          Στη πραγματικότητα, υπάρχουν πολλοί διαφορετικοί τύποι συναθροίσεων. Μπορεί να σκουντήξεις κάποιον καθώς παρπατάς στο πεζοδρόμιο. 
          Ή να καθίσεις δίπλα του στο λεωφορείο. Ίσως να μοιραστείτε ένα χωνάκι παγωτό. Κάθε μια από αυτές τις συναθροίσεις θα κατέληγε σε διαφορετική πιθανότητα μετάδοσης του ιού. 
          Αλλά στο μοντέλο μας, για απλότητα, όλες οι συναθροίσεις έχουν κοινό ρυθμό μετάδοσης.
        </div>
        <div>
          ——
        </div>
        <div>
          Καθώς συνεχίζεις το πειραματισμό με αυτές τις προσομοιώσεις (πάνω και κάτω) και σκέφτεσαι τη συσχέτισή τους με το το κοροναϊό/COVID-19, 
          να θυμάσαι:
        </div>
        <div>
          Ο ρυθμός μετάδοσης είναι εν μέρη συνάρτηση της <em>ασθένειας αυτής καθ'αυτής</em> (πόσο μεταδοτική είναι από τη φύση της), 
          αλλά επίσης και συνάρτηση του <em>περιβάλλοντος</em> στο οποίο ζει η ασθένεια. Αυτό περιλαμβάνει τόσο το φυσικό περιβάλλον (π.χ., θερμοκρασία αέρα και υγρασία)
           αλλά και το κοινωνικό περιβάλλον (π.χ., συμπεριφορές των ανθρώπων).
        </div>
        <div>
          Για παράδειγμα, όταν οι άνθρωποι πλένουν τα χέρια τους και φορούν μάσκες για να περιορίσουν τα σταγωνίδια του βήχα, 
          ο ρυθμός μετάδοσης ανά συνάθροιση μειώνεται — παρόλο που ο ιός δεν αλλάζει.
        </div>
        <div>
          Τώρα, για κάθε επιδημία, είναι δυνατόν να βρεθεί ένας ρυθμός μετάδοσης αρκετά μικρός ώστε να σταματήσει εντελώς η εξάπλωση. 
        </div>
        <div>
          Αλλά η COVID-19 είναι τόσο μεταδοτική, που είναι δύσκολο να φτάσεις κάτω από το κρίσιμο ρυθμό μετάδοσης. 
          Μπορούμε να πλείνουμε τα χέρια μας μόνο τόσες φορές τη μέρα. Ακόμα και η χρήση μάσκας στους δημόσιους χώρους δεν θα μειώσει το ρυθμό μετάδοσης αρκετά 
          (παρόλο που κάθε βοήθεια είναι σημαντική).
        </div>
        <div>
          Θα <em>μπορούσαμε</em> να φοράμε όλοι στολές προστασίας όποτε βγαίνουμε από το σπίτι. Τεχνικά αυτό θα έλυνε το πρόβλημα μετάδοσης
           (χωρίς να αλλάξουμε τις κοινωνικές μας συνήθειες). Αλλά μιας και αυτό δεν είναι, εμ, πρακτικό, ας αναλογιστούμε άλλους τρόπους για να αποφύγουμε
            την πλήρη ανάλωσή μας απο αυτή την ασθένεια.
        </div>
        <div>
          <h3>Μετακίνηση</h3>
        </div>
        <div>
          Εδώ είναι μια ακόμα ενέφικτη παραδοχή που κάναμε μέχρι στιγμής: επιτρέπαμε στους ανθρώπους να αλληλεπιδρούν μόνο με τους άμεσα γείτονές τους.
        </div>
        <div>
          Τι συμβαίνει αν επιτρέψουμε στους ανθρωπους να μετακινηθούν πιο μακριά? (Ακόμα υποθέτουμε 4 συναθροίσεις τη μέρα, μια παράμετρο που θα αναλύσουμε στο επόμενο κεφάλαιο.)
        </div>
        <div>
          Καθώς τραβάς τη μπάρα <strong>ακτίνα μετακίνησης</strong> παρακάτω, θα δείς ένα δείγμα από τις συναθροίσεις που ο φίλος μας στο κέντρο 
          θα πραγματοποιήσει σε κάποια δοθείσα μέρα. (Δεν μπορούμε να σχεδιάσουμε τις συναθροίσεις <em>όλων</em> επειδή θα γεμίζαμε γραμμές. 
          Θα πρέπει να βάλεις λίγη φαντασία. Να σημειώσω πως στο μοντέλο μας, σε αντίθεση με τη πραγματική ζωή, κάθε μέρα φέρνει ένα νέο (τυχάιο) σύνολο από συναθροίσεις.
        </div>
        <Figure>
          <Grid degree={24}
                gridRows={51}
                gridCols={51}
                maxTransmissionRate={1}
                nodeSize={10}
                nug={5}
                personHours={4}
                randomSeed={99}
                showAliveFraction={true}
                showInteractions={true}
                // showTransmissionProbabilitySlider={true}
                showTravelRadiusSlider={true}
                speed={0.8}
                travelRadius={15}
          />
        </Figure>
        <div>
          Σημείωσε πως αν περιοριστεί η μετακίνηση από την αρχή (π.χ., σε μια ακτίνα 2 μονάδων), είναι δυνατόν να επιβραδυνθέι η εξάπλωση σημαντικά.
        </div>
        <div>
          Αλλά τι θα συμβέι αν ξεκινήσεις χωρίς περιορισμό στις μετακινήσεις, αφήσεις την ασθένεια να απλωθεί σχεδόν παντού, και εφαρμόσεις περιορισμούς <em>αργότερα</em>?
        </div>
        <div>
          Με άλλα λόγια, πόσο νωρίς στη καμπύλη της εξάπλωσης πρέπει να εφαρμοστούν μέτρα περιορισμού των μετακινήσεων έτσι ώστε να επιβραδυνθεί η επιδημία ουσιαστικά?
        </div>
        <div>
          Εμπρός, δοκίμασέ το. Ξεκίνα με μια ακτίνα μετακινήσεων 25. Πειραματίσου με τη προσομοίωση, και πάτα παύση κοντά στο 10 τις εκατό θετικούς. 
          Τότε μείωσε την ακτίνα μετακινήσεων στο 2 και πάτα συνέχεια. Τι συμβαίνει?
        </div>
        <div>
          Συμπέρασμα: οι περιορισμοί μετακινήσεων αποδίδουν το μέγιστο αν εφαρμοστούν έγκαιρα, τουλάχιστον με σκοπό την ισοπέδωση της καμπύλης. (Οπότε ας τους εφαρμόσουμε!)
        </div>
        <div>
          Αλλά μπορούν να βοηθήσουν και στα μετέπειτα στάδια της επιδημίας, για τουλάχιστον 2 λόγους:
        </div>
        <div>
          <ol>
            <li>Λεωφορεία, τρένα και αεροδρόμια είναι μέρη όπου οι άνθρωποι πλησιάζουν πολύ ο ένας τον άλλο. Όταν σταματήσει η χρήση αυτών των μέσων, ελαχιστοποιούνται οι πιθανές συναθροίσεις με φορείς της νόσου. (Θα το ερευνήσουμε σε βάθος παρακάτω.)</li>
            <li>Ο περιορισμός μετακινήσεων είναι κρίσιμος <em>σε συνεργασία με τα περιοριστικά μέτρα ανά περιοχή</em>. 
            Αν μια περιοχή φέρει την εξάπλωση υπό έλεγχο, αλλά οι γειτονικές περιοχές είναι σε έξαρση, πρέπει να προστατευτεί η ελεγχώμενη περιοχή. 
            (Δεν θα εξερευνήσουμε τα μέτρα περιορισμού εδώ, αλλά αν ενδιαφέρεσαι, μπορείς να ξεκινήσεις <a href="https://necsi.edu/beyond-contact-tracing">εδώ</a>.)</li>
          </ol>
        </div>
        <div>
          <h3>Πλήθος συναθροίσεων</h3>
        </div>
        <div>
          Λοιπόν, ας κοιτάξουμε πραγματικά τι γίνεται.
        </div>
        <div>
          Στη προσομοίωση παρακάτω, μπορείς να μεταβάλλεις τις <strong>συναθροίσεις ανά ημέρα</strong>.
        </div>
        <div>
          Ας ξεκινήσουμε με 20. Ποια έιναι η ελάχιστη τιμή που χρειαζόμαστε για να κρατήσουμε την επιδημία υπό έλεγχο?
        </div>
        <Figure>
          <Grid degree={24}
                gridRows={51}
                gridCols={51}
                personHours={20}
                nodeSize={10}
                nug={5}
                randomSeed={100}
                showAliveFraction={true}
                showInteractions={true}
                showPersonHoursSlider={true}
                showTransmissionProbabilitySlider={true}
                showTravelRadiusSlider={true}
                speed={0.8}
                transmissionProbability={0.3}
                travelRadius={10}
          />
        </Figure>
        <div>
          Όπως μπορείς να δεις, η μείωση των συναθροίσεων έχει <em>δραματική επίπτωση</em> στην επιδημία. Ισοπεδώνει τη καμπύλη με ευκολία, 
          και έχει ακόμα και την δυναμική (αν τη πάρουμε στα σοβαρά) να την ανασχαίσει εντελώς.
        </div>
        <div>
          Αυτό είναι το επιθυμητό αποτέλεσμα όταν γίνεται λόγος για "κοινωνική αποστασιοποίηση." Για αυτό τόσοι άνθρωποι συμπαρατάσσονται με τις επίσημες αρχές 
          για να σταματήσουν οι παρελάσεις και να κλείσουν τα σχολεία, και γιατί όλοι μας πρέπει να μείνουμε μακριά από μπαρ, καφετέριες εμπορικά κέντρα και εστιατόρια,
           και να δουλέυουμε όσο γίνεται από το σπίτι.
        </div>
        <div>
          Η UEFA ευεργέτησε τρομερά τους φιλάθλους αναβάλλοντας τις διοργανώσεις. Τώρα πρέπει να ακολουθήσουμε το παράδειγμα και να <em>αναβάλλουμε τα πάντα</em>.
        </div>
        <div>
          Έτσι όπως το καταλαβαίνω εγώ (και πάλι, δεν είμαι ειδικός), αυτό είναι το πιο σημαντικό όπλο που έχουμε στη μάχη με την επιδημία.
        </div>
        <div>
          <h3>Θάνατος</h3>
        </div>
        <div>
          Δεν επανέρχονται όλοι οι ασθενείς από τη ασθένεια. Πολλοί καταλήγουν {dead}.
        </div>
        <div>
          Εισαγάγουμε το <strong>ρυθμό θνησιμότητας</strong>.
        </div>
        <div>
          Στη προσομοίωσή μας, ρυθμός θνησιμότητας είναι η πιθανότητα ένας ασθενής τελικά να καταλήξει, υποθέτοντας πως έλαβε κανονική/επαρκή υγειονομική περίθαλψη.
        </div>
        <div>
           Ο ρυθμός θνησιμότητας της COVID-19 εκτιμάται μεταξύ 1 τις εκατό και <a href="https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(20)30195-X/fulltext">6 τις εκατό</a>. 
           Ίσως καταλήξει να είναι κάτω από 1 τις εκατό, αν υπάρχουν πολλά μη καταγεγραμμένα κρούσματα. 
           Είναι σίγουρα μεγαλυτερο όταν το σύστημα υγείας είναι επιβαρυμένο (περισσότερα σχετικά παρακάτω).
        </div>
        <div>
          Θα ξεκινήσουμε στο 3 τις εκατό ρυθμό θνησιμότητας για το μοντέλο μας, αλλά μπορείς να μεταβάλλεις τη τιμή παρακάτω:
        </div>
        <Figure>
          <Grid gridRows={101}
                gridCols={101}
                nodeSize={5}
                nug={5}
                randomSeed={100}
                showAliveFraction={true}
                showDeaths={true}
                showDeathRateSlider={true}
                showPersonHoursSlider={true}
                showTransmissionProbabilitySlider={true}
                showTravelRadiusSlider={true}
                speed={1}
                transmissionProbability={0.3}
          />
        </Figure>
        <div>
          Αυτές οι απλωμένες μαύρες κουκίδες μπορεί να μην σου τραβάνε τη προσοχή. Αλλά θυμίσου, κάθε μια είναι μια χαμένη ανθρώπινη ζωή από την ασθένεια.
        </div>
        <div>
          <h3>Χωρητικότητα Νοσοκομείων</h3>
        </div>
        <div>
          Παρακάτω θα βρείς μια τελευταία καινούργια μπάρα. Ελέγχει τη <strong>χωρητικότητα των νοσοκομειών</strong>.
        </div>
        <div>
          Αυτός είναι ο αριθμός των ασθενών (εκφρασμένος ως ποσοστό του πληθυσμού) που μπορεί να αντέξει το σύστημα υγείας σε κάθε δεδομένη στιγμή.
        </div>
        <div>
          Γιατί έχει σημασία η χωρητικότητα των νοσοκομείων?
        </div>
        <div>
          Όταν υπάρχουν περισσότεροι ασθενείς απ' όσους μπορεί να αντέξει το σύστημα, δεν μπορούν να λάβουν τη περίθαλψη που χρειάζονται.
           Και ως αποτέλεσμα, έχουμε σημαντικά περισσότερους θανάτους. Όπως είδαμε στην Ιταλία, κάποιοι πιθανόν να αφεθούν στους διαδρόμους μέχρι να τους βρεί ο θάνατος.
        </div>
        <div>
          Έχω ακούσει ανθρώπους να μιλάνε για τη χωρητικότητα των νοσοκομείων ως “πλήθος κρεβατιών,” ή “πλήθος κρεβατιών εντατικής θεραπειας.” 
          Κατά την άποψή μου, απλά “κρεβάτια,” μπορούν να στηθούν μέσα σε ένα γυμνάσιο σε μηδέν χρόνο. Νομίζω πως το μεγάλο έλλειμα είναι ιατρικός εξοπλισμός — ειδικά αναπνευστήρες.
           Αλλά ίσως να είναι και το ιατρικό προσωπικό, οι “υγειονομικοί,” δεν ξέρω.
        </div>
        <div>
          Στη πραγματικότητα, αυτό έχει <em>μεγάλη</em> σημασία. Πρέπει να εντοπίσουμε τη πραγματική έλλειψη, και να κάνουμε το καλύτερο δυνατό για να τη μετριάσουμε.
           Αλλά για μια προσομοίωση, μπορούμε απλά να σηκώσουμε τα χέρια και να δεχτούμε πως υπαρχει περιορισμένη χωρητικότητα κάπου στο σύστημα.
            Θυμίσου, δεν προσπαθούμε να μοντελοποιήσουμε τη πραγματικότητα σε μεγάλο βαθμό.
        </div>
        <div>
          Στο μοντέλο της ασθένειάς μας, να πως κατερρέει το σύστημα υγείας:
        </div>
        <div>
          <strong>Όταν υπαρχουν περισσότερα κρούσματα από τη χωρητικότητα των νοσοκομείων, ο ρυθμός θνησιμότητας <em>διπλασιάζεται</em>.</strong>
        </div>
        <div>
          Δοκίμασέ το. Δώσε μεγάλη προσοχή στο <em>ρυθμό θνησιμότητας εισαγωγών</em> (τη τιμή της μπάρας), που ορίζει πόσο συχνά οι 
          άνθρωποι πεθαίνουν στη καλύτερη των περιπτώσεων, έναντι του <em>πραγματικού ρυθμού θνησιμότητας</em> (σημασμένου στο γράφημα παρακάτω), 
          που μας λέει πως συμπεριφέρεται το σύστημα υπό πίεση.
        </div>
        <Figure>
          <Grid gridRows={101}
                gridCols={101}
                hospitalCapacityPct={0.05}
                nodeSize={5}
                nug={5}
                personHours={15}
                randomSeed={100}
                showAliveFraction={true}
                showDeaths={true}
                showDeathRateSlider={true}
                showHospitalCapacitySlider={true}
                // showPersonHoursSlider={true}
                // showTransmissionProbabilitySlider={true}
                // showTravelRadiusSlider={true}
                speed={1}
                transmissionProbability={0.28}
                travelRadius={15}
          />
        </Figure>
        <div>
          <h3>"Ισοπέδωσε τη καμπύλη"</h3>
        </div>
        <div>
          Το έχεις ξανα ακούσει. Ξέρεις για πιο λόγο είναι σημαντικό. Αλλά τώρα θα αποκτήσεις και μια διαίσθηση σχετικά με αυτό.
        </div>
        <div>
          Αυτό είναι το τελικό σου test για σήμερα.
        </div>
        <div>
          Ο ρυθμός θνησιμότητας εισαγωγών είναι σταθερός στο 3 τις εκατό. Η Χωρητικότητα Νοσοκομείων είναι σταθερή στο 5 τις εκατό.
        </div>
        <div>
          Πειραματίσου με τη προσομοίωση και παρατήρησε το πραγματικό ρυθμό θνησιμότητας: 6 τις εκατό. Στη συνέχεια προσπάθησε να μειώσεις αυτό τον αριθμό.
        </div>
        <div>
          Με άλλα λόγια, ισοπέδωσε τη καμπύλη:
        </div>
        <Figure>
          <Grid gridRows={101}
                gridCols={101}
                hospitalCapacityPct={0.05}
                nodeSize={5}
                nug={5}
                personHours={15}
                randomSeed={100}
                showAliveFraction={true}
                showDeaths={true}
                // showDeathRateSlider={true}
                // showHospitalCapacitySlider={true}
                showPersonHoursSlider={true}
                showTransmissionProbabilitySlider={true}
                showTravelRadiusSlider={true}
                speed={1}
                transmissionProbability={0.4}
                travelRadius={15}
          />
        </Figure>
        <div>
          Όπως και να εξελίχθηκε η προσομοίωση, η πραγματικότητα θα είναι <em>πολύ σκληρότερη</em>. Οι πραγματικοί άνθρωποι δεν αναποκρίνονται όπως οι μπάρες στις σελίδες.
        </div>
        <div>
          Και το αναπόφευκτο: ακόμα και αν κατεφέρουμε να "ισοπεδώσουμε τη καμύλη" αρκετά ώστε να κατανεμηθεί ομοιόμορφα το φορτίο κρουσμάτων στο σύστημα υγείας,
           είμαστε ακόμα σε θέση να χάσουμε εκατομμύρια ζωές.
        </div>
        <div>
          Ίσως να μην φτάσουμε στο χειρότερο σενάριο. Ίσως να μην τους χάσουμε στους διαδρόμους των νοσοκομείων. Αλλά όσο ο ιός συνεχίζει να εξαπλώνεται — για το οποίο έχουμε κάθε δείγμα να πιστεύουμε — 
          το μέλλον επιφυλάσσει ασύλληπτη τραγωδία.
        </div>
        <div>
          Εκτός και αν κάνουμε τις σωστές πράξεις σήμερα.
        </div>
        <div>
          Σταμάτα τις μετακινήσεις. Σταμάτα να βγαίνεις από το σπίτι. Σταμάτα να συναντάς τους φίλους και συγγενείς σου.
           Σταμάτα να τρως σε εστιατόρια. Ανέβαλε ό,τι μπορείς. Εαν παίρνεις αποφάσεις για τα πράγματα, <em>ακύρωσέ τα</em>. Κλειδωσέ. Τα. Όλα.
        </div>
        <div>
          Σε εκπλιπαρώ: δράσε αποφασιστικά τώρα.
        </div>
        <div>
          Η COVID-19 εξαπλώνεται, και δεν θα σταματήσει με ημίμετρα.
        </div>




        <div>
          &nbsp;
        </div>
        <div>
          &nbsp;
        </div>
        <div>
          ——
        </div>
        <div>
          &nbsp;
        </div>
        <div>
          <b>Άδεια</b>
        </div>
        <div>
          <a href="https://creativecommons.org/share-your-work/public-domain/cc0/">CC0</a> — με καμία επιφύλαξη δικαιωμάτων.
           Είσαι ελέυθερος να χρησιμοποιήσεις αυτό το έργο όπως νομίζεις, συμπεριλαμβανομένης της αντιγραφής, τροποποίησης, και διανομής του στο δικό σου site.
        </div>
        <div>
          <a href="https://github.com/georgegtx/stayhome">Πηγαίος Κώδικας</a>
        </div>
        <div>
          <b>Πλήρες Μοντέλο</b>
        </div>
        <div>
          Το πλήρες μοντέλο, με όλες τις μπάρες, βρίσκεται στο τέλος της σελίδας.
        </div>
        <div>
          <b>Ευχαριστίες</b>
        </div>
        <div>
          Θα ήθελα να ευχαριστήσω τον <a href="https://meltingasphalt.com/about/">Kevin Simler</a> για το πρωτότυπο έργο του.
        </div>
        <div>
          <b>Περαιτέρω διάβασμα</b>
        </div>
        <div>
          <ul>
            <li><a href="https://medium.com/@tomaspueyo/coronavirus-act-today-or-people-will-die-f4d3d9cd99ca">Coronavirus: Why You Must Act Now</a> — Tomas Pueyo explains why we've been systematically underestimating this thing, and why that needs to change. Just read it.</li>
            <li><a href="https://medium.com/@joschabach/flattening-the-curve-is-a-deadly-delusion-eea324fe9727">Don’t "Flatten the Curve," Stop It!</a> — Joscha Bach does some calculations on hospital capacity and concludes that "flattening the curve" won't be enough; we have to completely stop the outbreak.</li>
            <li>The Washington Post's <a href="https://www.washingtonpost.com/graphics/2020/world/corona-simulator/">excellent simulation</a> — brilliant use of billiard balls to show transmission and social distancing.</li>
          </ul>
        </div>



        <div>
          &nbsp;
        </div>

        <div>
          <h3>Πλήρες Μοντέλο</h3>
        </div>
        <Figure>
          <Grid gridRows={131}
                gridCols={131}
                // highlight="transmissionRate"
                hospitalCapacityPct={0.02}
                nodeSize={5}
                nug={5}
                randomSeed={100}
                personHours={3}
                travelRadius={5}
                transmissionProbability={0.37}
                showAliveFraction={true}
                showAllControls={true}
                // showDaysPerStateControls={true}
                showDeaths={true}
                // showPersonHoursSlider={true}
                // showTransmissionProbabilitySlider={true}
                // showTravelRadiusSlider={true}
                speed={1}
          />
        </Figure>

      </div>
    );
  }

  render() {
    return (
      <div className="main-container">
        <div className="blank-l"/>
        <div className="content">
          {this.renderMainPost()}
        </div>
        <div className="blank-r"/>
        <div className="footer"/>
      </div>
    );
  }
}

export default App
